Revit 2024 API
AnalyticalDistributionNodePropertyData Properties
The AnalyticalDistributionNodePropertyData type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NumberOfPhases
 The number of phases.
See Also
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace